[PR_Roboticist X2SoldierClassTemplate]
+DisplayName="机械专家"
+ClassSummary="机械专家专门破解机械敌人，或者用他们的霰弹枪拆除它们。"
+LeftAbilityTreeTitle="重炮手"
+RightAbilityTreeTitle="黑客"
AbilityTreeTitles[0]="拆除"
AbilityTreeTitles[1]="机械专家"
AbilityTreeTitles[2]="黑客"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Technician"
+RandomNickNames[1]="Professor"
+RandomNickNames[2]="Farnsworth"
+RandomNickNames[3]="Slugger"
+RandomNickNames[4]="Roboticist"